/* Errors returned by the device in the form of xml */
"Success" = "Êxito";
"TestInProgress" = "Teste em andamento... Aguarde.";
"ErrorDeviceBusy" = "O dispositivo está ocupado. Tente novamente mais tarde.";
"ErrorDuplicateDisplayName" = "Nome de exibição ou lugar duplicado. Atribua um nome diferente e tente de novo.";
"ErrorEmptyEntry" = "Uma das entradas nas configurações enviadas ao dispositivo está vazia. Verifique se todas as entradas são válidas e tente novamente.";
"ErrorListFull" = "Não há espaço disponível para adicionar esta entrada. Exclua uma entrada do dispositivo e tente novamente.";
"ErrorSettingNotTested" = "Esta configuração não foi testada.";
"ErrorSystemFailure" = "Ocorreu uma falha crítica. Tente novamente mais tarde.";
"ErrorNoMoreSpace" = "O tamanho máximo do anexo de email é muito grande para o servidor selecionado. Insira um valor mais baixo e tente novamente.";
"ErrorNoWritePermission" = "A pasta selecionada não tem permissão de gravação. Defina os direitos de acesso apropriados para a pasta e tente novamente.";
"ErrorConnectionFailed" = "O dispositivo não pode se conectar ao servidor remoto especificado. Verifique as configurações do servidor.";
"ErrorConnectionRefused" = "O servidor recusou a conexão. Verifique se ele está ligado e funcionando.";
"ErrorServerNotFound" = "O dispositivo não pode determinar o hostname do servidor. Verifique as configurações do servidor.";
"ErrorWrongCredentials" = "O servidor recusou as credenciais de usuário utilizadas para autenticação. Informe as credenciais corretas e tente novamente.";
"ErrorConnectionProblem" = "Ocorreu um problema na conexão com o servidor remoto. Verifique se o servidor está conectado à rede e funcionando.";
"ErrorProtocolNotSupported" = "O servidor remoto usa um protocolo incompatível.";
"ErrorInvalidFileOrDirectory" = "The path that you have specified is invalid. Please specify a valid path and try again.";
"ErrorInvalidFolderPath" = "The path that you have specified is invalid. Please specify a valid path and try again.";
"ErrorInvalidShare" = "A pasta compartilhada é inválida. Selecione uma pasta diferente e tente novamente.";
"ErrorAuthenticationNeeded" = "O servidor especificado requer autenticação. Informe as credenciais corretas para acessar o servidor e tente novamente.";
"ErrorSecureConnectionNotSupported" = "O servidor não suporta conexão segura. Desmarque a caixa de seleção Usar SSL e tente novamente.";
"ErrorSenderInvalid" = "O endereço de email do remetente é inválido. Informe um endereço válido e tente novamente.
";
"ErrorRecipientInvalid" = "O endereço de email do destinatário é inválido. Informe um endereço válido e tente novamente.";
"ErrorServerError" = "O servidor retornou um erro. Não é possível realizar a operação solicitada. Verifique se os detalhes do servidor informado estão corretos.";
"ErrorInvalidServerName" = "O servidor especificado é inválido. Informe um servidor SMTP válido e tente novamente.";

"404 Not Found" = "Não é possível localizar o dispositivo. Verifique se o dispositivo está conectado à rede e ligado.";
"400 Bad Request" = "A solicitação não pode ser processada devido a um erro na solicitação. Tente novamente mais tarde.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "O dispositivo não retornou um URL válido. Aguarde alguns minutos e tente novamente.";

/* XML Data validation errors */
"Setting Error" = "Erro de Dados Ausentes ou Inválidos";
"MISSING_FOLDER_SETTING" = "Alguns detalhes de destino da pasta estão faltando. Selecione uma pasta, informe o nome de usuário e a senha e tente novamente.";
"MISSING_EMAIL_SETTING" = "Alguns detalhes do destino do email estão faltando. Forneça todas as configurações de email e tente novamente.";
"MISSING_SERVER_CREDENTIALS" = "As credenciais do servidor estão faltando. Informe o nome de usuário e a senha e tente novamente.";
"MISSING_DISPLAY_NAME" = "O nome do Remetente está faltando. Insira um nome para o Remetente e tente de novo.";
"MISSING_EMAIL_ADDRESS" = "O endereço de email está faltando. Informe um endereço válido e tente novamente.";
"MISSING_SERVER" = "O servidor está faltando. Informe um servidor e tente novamente.";

"INVALID_PIN" = "O Número de Identificação Pessoal fornecido é inválido. Ele deve conter exatamente 4 dígitos. Forneça um PIN válido e tente novamente.";
"INVALID_SERVER_PORT" = "O número de porta do servidor informado é inválido. Ele deve ser um valor entre 1 e 65535.";
"INVALID_ATTMT_SIZE" = "O tamanho máximo do anexo inserido é inválido. O valor deve estar entre 1 e 9999. Especifique -1 para configuração automática do tamanho do anexo.";
"INVALID_DFADESTINATION" = "O Destino de Fax Digital selecionado é inválido. Selecione um destino correto.";
"INVALID_POLLING_TIME" = "O Intervalo de Pesquisa selecionado é inválido. Os valores válidos são 5, 10, 15, 20, 30, 45 e 60. Selecione um intervalo apropriado e tente novamente.";
"INVALID_DISPLAY_NAME" = "O nome do Remetente inserido não é válido. Insira um nome de Remetente que tenha menos de 25 caracteres.";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Erro";
"GENERIC_DEVICE_ERROR_TITLE" = "Erro de Dispositivo";
"GENERIC_DEVICE_ERROR_DESC" = "Ocorreu um erro desconhecido na comunicação com o dispositivo. Tente novamente mais tarde.";
"XML_PARSING_ERROR" = "O dispositivo retornou dados inválidos. Aguarde alguns minutos e tente novamente.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Erro na comunicação com o dispositivo. Verifique se o dispositivo e a máquina estão conectados à rede tente novamente.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Cancelar";
"Hide" = "Ocultar";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Dispositivo não encontrado";
"DEVICE_NOT_FOUND_DESC" = "Ocorreu um problema na comunicação com o dispositivo. Verifique se o dispositivo está ligado e conectado corretamente e tente novamente.";

"PML_ERROR_TITLE" = "Erro de Dispositivo";
"PML_ERROR_DESC1" = "Ocorreu um problema ao configurar as informações para o dispositivo. Verifique se os valores fornecidos são válidos.";

"SETTING_REJECTED_TITLE" = "Configurações não aceitas";

"SETTING_REJECTED_DESCRIPTION" = "Não foi possível executar a configuração porque o dispositivo está protegido por uma senha administrativa. Use o Servidor da Web Incorporado para remover a senha administrativa. Consulte a documentação do dispositivo, para mais informações";
"GENERAL_DATA_MISSING_DESCRIPTION" = "Um ou mais campos não contêm nenhum dado. Preencha todos os campos ou clique em Cancelar.";

//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Porta/Tampa está aberta";
"DOOR_OPEN_DESC" = "A impressora não pode imprimir porque uma tampa está aberta. Feche todas as tampas da impressora.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "A impressora está em estado de erro";
"INCORRECT_STATE_DESC" = "Resolva a condição de erro do dispositivo e tente novamente.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "A impressora está ocupada no momento";
"DEVICE_BUSY_DESC" = "Aguarde enquanto a impressora finaliza seu trabalho atual.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Identificador de Chamadas não suportado";
"CALLER_ID_NOT_SUPPORTED_DESC" = "O País/Região atualmente definido no dispositivo não suporta o Identificador de Chamadas. Use o painel frontal do dispositivo para selecionar um País/Região com suporte para Identificador de Chamadas e tente novamente.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Não foi possível aplicar as definições.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Confirme se o dispositivo está on-line e se não está processando um trabalho de fax.";

